turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cm/atdf/ATSAM4CMP16C_1.atdf
        <register caption="SLCDC Write Protection Status Register" name="SLCDC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="SLCDC LSB Memory Register (com = 0)" name="SLCDC_LMEMR0" offset="0x200" rw="RW" size="4">
          <bitfield caption="LSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="SLCDC MSB Memory Register (com = 0)" name="SLCDC_MMEMR0" offset="0x204" rw="RW" size="4">
          <bitfield caption="MSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="MPIXEL"/>
        </register>
        <register caption="SLCDC LSB Memory Register (com = 1)" name="SLCDC_LMEMR1" offset="0x208" rw="RW" size="4">
          <bitfield caption="LSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="SLCDC MSB Memory Register (com = 1)" name="SLCDC_MMEMR1" offset="0x20C" rw="RW" size="4">
          <bitfield caption="MSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="MPIXEL"/>
        </register>
        <register caption="SLCDC LSB Memory Register (com = 2)" name="SLCDC_LMEMR2" offset="0x210" rw="RW" size="4">
          <bitfield caption="LSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="SLCDC MSB Memory Register (com = 2)" name="SLCDC_MMEMR2" offset="0x214" rw="RW" size="4">
          <bitfield caption="MSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="MPIXEL"/>
        </register>
        <register caption="SLCDC LSB Memory Register (com = 3)" name="SLCDC_LMEMR3" offset="0x218" rw="RW" size="4">
          <bitfield caption="LSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="SLCDC MSB Memory Register (com = 3)" name="SLCDC_MMEMR3" offset="0x21C" rw="RW" size="4">
          <bitfield caption="MSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="MPIXEL"/>
        </register>
        <register caption="SLCDC LSB Memory Register (com = 4)" name="SLCDC_LMEMR4" offset="0x220" rw="RW" size="4">
          <bitfield caption="LSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="SLCDC MSB Memory Register (com = 4)" name="SLCDC_MMEMR4" offset="0x224" rw="RW" size="4">
          <bitfield caption="MSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="MPIXEL"/>
        </register>
        <register caption="SLCDC LSB Memory Register (com = 5)" name="SLCDC_LMEMR5" offset="0x228" rw="RW" size="4">
          <bitfield caption="LSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="SLCDC MSB Memory Register (com = 5)" name="SLCDC_MMEMR5" offset="0x22C" rw="RW" size="4">
          <bitfield caption="MSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="MPIXEL"/>
        </register>
      </register-group>
      <value-group caption="" name="SLCDC_MR__COMSEL">
        <value caption="COM0 is driven by SLCDC, COM1:5 are driven by digital function" name="COM_0" value="0x0"/>
        <value caption="COM0:1 are driven by SLCDC, COM2:5 are driven by digital function" name="COM_0TO1" value="0x1"/>
        <value caption="COM0:2 are driven by SLCDC, COM3:5 are driven by digital function" name="COM_0TO2" value="0x2"/>
        <value caption="COM0:3 are driven by SLCDC, COM4:5 are driven by digital function" name="COM_0TO3" value="0x3"/>
        <value caption="COM0:4 are driven by SLCDC, COM5 is driven by digital function" name="COM_0TO4" value="0x4"/>
        <value caption="COM0:5 are driven by SLCDC, No COM pin driven by digital function" name="COM_0TO5" value="0x5"/>
      </value-group>
      <value-group caption="" name="SLCDC_MR__BUFTIME">
        <value caption="Nominal drive time is 0% of SLCK period" name="OFF" value="0x0"/>
        <value caption="Nominal drive time is 2 periods of SLCK clock" name="X2_SLCK_PERIOD" value="0x1"/>
        <value caption="Nominal drive time is 4 periods of SLCK clock" name="X4_SLCK_PERIOD" value="0x2"/>
        <value caption="Nominal drive time is 8 periods of SLCK clock" name="X8_SLCK_PERIOD" value="0x3"/>
        <value caption="Nominal drive time is 16 periods of SLCK clock" name="X16_SLCK_PERIOD" value="0x4"/>
        <value caption="Nominal drive time is 32 periods of SLCK clock" name="X32_SLCK_PERIOD" value="0x5"/>
        <value caption="Nominal drive time is 64 periods of SLCK clock" name="X64_SLCK_PERIOD" value="0x6"/>
        <value caption="Nominal drive time is 128 periods of SLCK clock" name="X128_SLCK_PERIOD" value="0x7"/>
        <value caption="Nominal drive time is 50% of SLCK period" name="PERCENT_50" value="0x8"/>
        <value caption="Nominal drive time is 100% of SLCK period" name="PERCENT_100" value="0x9"/>
      </value-group>
      <value-group caption="" name="SLCDC_MR__BIAS">
        <value caption="Static" name="STATIC" value="0x0"/>
        <value caption="Bias 1/2" name="BIAS_1_2" value="0x1"/>
        <value caption="Bias 1/3" name="BIAS_1_3" value="0x2"/>
      </value-group>
      <value-group caption="" name="SLCDC_FRR__PRESC">
        <value caption="Slow clock is divided by 8" name="SLCK_DIV8" value="0x0"/>
        <value caption="Slow clock is divided by 16" name="SLCK_DIV16" value="0x1"/>
        <value caption="Slow clock is divided by 32" name="SLCK_DIV32" value="0x2"/>
        <value caption="Slow clock is divided by 64" name="SLCK_DIV64" value="0x3"/>
        <value caption="Slow clock is divided by 128" name="SLCK_DIV128" value="0x4"/>
        <value caption="Slow clock is divided by 256" name="SLCK_DIV256" value="0x5"/>
        <value caption="Slow clock is divided by 512" name="SLCK_DIV512" value="0x6"/>
        <value caption="Slow clock is divided by 1024" name="SLCK_DIV1024" value="0x7"/>
      </value-group>
      <value-group caption="" name="SLCDC_FRR__DIV">
        <value caption="Clock output from prescaler is divided by 1" name="PRESC_CLK_DIV1" value="0x0"/>
        <value caption="Clock output from prescaler is divided by 2" name="PRESC_CLK_DIV2" value="0x1"/>
        <value caption="Clock output from prescaler is divided by 3" name="PRESC_CLK_DIV3" value="0x2"/>
        <value caption="Clock output from prescaler is divided by 4" name="PRESC_CLK_DIV4" value="0x3"/>
        <value caption="Clock output from prescaler is divided by 5" name="PRESC_CLK_DIV5" value="0x4"/>
        <value caption="Clock output from prescaler is divided by 6" name="PRESC_CLK_DIV6" value="0x5"/>
        <value caption="Clock output from prescaler is divided by 7" name="PRESC_CLK_DIV7" value="0x6"/>
        <value caption="Clock output from prescaler is divided by 8" name="PRESC_CLK_DIV8" value="0x7"/>
      </value-group>
      <value-group caption="" name="SLCDC_DR__DISPMODE">
        <value caption="Normal Mode-Latched data are displayed." name="NORMAL" value="0x0"/>
        <value caption="Force Off Mode-All pixels are invisible. (The SLCDC memory is unchanged.)" name="FORCE_OFF" value="0x1"/>
        <value caption="Force On Mode-All pixels are visible. (The SLCDC memory is unchanged.)" name="FORCE_ON" value="0x2"/>
        <value caption="Blinking Mode-All pixels are alternately turned off to the predefined state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)" name="BLINKING" value="0x3"/>
        <value caption="Inverted Mode-All pixels are set in the inverted state as defined in SLCDC memory. (The SLCDC memory is unchanged.)" name="INVERTED" value="0x4"/>
        <value caption="Inverted Blinking Mode-All pixels are alternately turned off to the predefined opposite state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)" name="INVERTED_BLINK" value="0x5"/>
        <value caption="User Buffer Only Load Mode-Blocks the automatic transfer from User Buffer to Display Buffer." name="USER_BUFFER_LOAD" value="0x6"/>
        <value caption="Buffer Swap Mode-All pixels are alternatively assigned to the state defined in the User Buffer, then to the state defined in the Display Buffer at LCDBLKFREQ frequency." name="BUFFERS_SWAP" value="0x7"/>
      </value-group>
      <value-group caption="" name="SLCDC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x4C4344"/>
      </value-group>
    </module>
    <module caption="Static Memory Controller" name="SMC" version="6498G">
      <register-group name="SMC">
        <register caption="SMC Setup Register (CS_number = 0)" name="SMC_SETUP0" offset="0x0" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in WRITE Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in READ Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 0)" name="SMC_PULSE0" offset="0x4" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000007F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00007F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x007F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x7F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 0)" name="SMC_CYCLE0" offset="0x8" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC Mode Register (CS_number = 0)" name="SMC_MODE0" offset="0xC" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE0__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT" values="SMC_MODE0__BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="SMC_MODE0__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
          <bitfield caption="Page Mode Enabled" mask="0x01000000" name="PMEN"/>
          <bitfield caption="Page Size" mask="0x30000000" name="PS" values="SMC_MODE0__PS"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 1)" name="SMC_SETUP1" offset="0x10" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in WRITE Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in READ Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 1)" name="SMC_PULSE1" offset="0x14" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000007F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00007F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x007F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x7F000000" name="NCS_RD_PULSE"/>
        </register>
